ATsupportum/src/Catalogs/ДиапазоныСетевыхАдресов_ат/ДиапазоныСетевыхАдресов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДиапазоныСетевыхАдресов_ат</name>
  <attributes>
    <name>НачальныйIP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйIP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальнаяСеть</name>
    <type>
      <types>CatalogRef.ВиртуальныеСети_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсеть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНачальныйIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКонечныйIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаСети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ДиапазоныСетевыхАдресов_ат/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НачальныйIPПриИзменении(Элемент)
	Объект.НачальныйIP 	 = РаботаССерверамиСлужебный_ат.ПреобразоватьIPВЧисло("" + A1 +"."+ B1 +"."+ C1 +"."+ D1);	
	Если  Объект.НачальныйIP < Число("4294967295") тогда
		КоличествоИПвДиапазоне();
	Иначе
		ВсегоАдресов = 0;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст  	= "IP не может быть больше либо равно 255.255.255.255";
		Сообщение.Поле = "Объект.НачальныйIP";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииАдресаСети()

	Объект.АдресСети = РаботаССерверамиСлужебный_ат.ПреобразоватьIPВЧисло("" + A3 +"."+ B3 +"."+ C3 +"."+ D3);
	Если  Объект.АдресСети < Число("4294967295") тогда
		
	иначе
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст  	= "IP не может быть больше либо равно 255.255.255.255";
		Сообщение.Поле 		= "Объект.АдресСети";
		Сообщение.Сообщить();
		A3 = 0;
		B3 = 0;
		C3 = 0;
		D3 = 0;
		
	КонецЕсли;	


КонецПроцедуры



&НаКлиенте
Процедура КонечныйIPПриИзменении(Элемент)

	Объект.КонечныйIP 	 = РаботаССерверамиСлужебный_ат.ПреобразоватьIPВЧисло("" + A2 +"."+ B2 +"."+ C2 +"."+ D2);
	Если  Объект.КонечныйIP < Число("4294967295") тогда
		КоличествоИПвДиапазоне();
	Иначе
		ВсегоАдресов = 0;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст  	= "IP не может быть больше либо равно 255.255.255.255";
		Сообщение.Поле 		= "Объект.КонечныйIP";
		Сообщение.Сообщить();

	КонецЕсли;

КонецПроцедуры


&НаСервере
функция КоличествоИПвДиапазоне()
	
	Если (Объект.КонечныйIP < Число("4294967295")) и (Объект.НачальныйIP < Число("4294967295"))  тогда
		
		Если Объект.НачальныйIP > Объект.КонечныйIP тогда
			ВсегоАдресов = Объект.НачальныйIP - Объект.КонечныйIP + 1;
		ИначеЕсли  Объект.НачальныйIP < Объект.КонечныйIP тогда
			ВсегоАдресов = Объект.КонечныйIP - Объект.НачальныйIP + 1;
		ИначеЕсли  Объект.НачальныйIP = Объект.КонечныйIP  тогда
			ВсегоАдресов = 1;
			
		КонецЕсли;
	Иначе
		ВсегоАдресов = 0;
		
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Подсеть тогда
		//   РазложитьСтрокуВМассивПодстрок(СтрЗаменить(IP," ", ""), ".");
		
		ЗагрузитьИП()  ;
		КоличествоИПвДиапазоне();
	Иначе
		
		ЗагрузитьИП()  ;
		КоличествоИПвДиапазоне();
		ЗаполняемАдресСети();
	КонецЕсли;


	ПроверкаОтображения();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИП()
	
	// ТНИ - текстовый начальный IP
	// ТКИ - текстовый конечный IP
	// ГНИ - группы начального IP
	// ГКИ - группы конечного IP
	
	ТекстНачИП = РаботаССерверамиСлужебный_ат.ПреобразоватьЧислоВТекстовыйIP(Объект.НачальныйIP) ;
	ТекстКонИП = РаботаССерверамиСлужебный_ат.ПреобразоватьЧислоВТекстовыйIP(Объект.КонечныйIP) ;
	ГНИ = РаботаССерверамиСлужебный_ат.РазложитьСтрокуВМассивПодстрок(ТекстНачИП,".");
	ГКИ = РаботаССерверамиСлужебный_ат.РазложитьСтрокуВМассивПодстрок(ТекстКонИП,".");
	
	Если ГНИ.Количество() = 4 тогда 
		
		A1 = ГНИ[0];
		B1 = ГНИ[1];
		C1 = ГНИ[2];
		D1 = ГНИ[3];
		
	КонецЕсли;
	
	Если ГКИ.Количество() = 4 тогда 
		
		A2 = ГКИ[0];
		B2 = ГКИ[1];
		C2 = ГКИ[2];
		D2 = ГКИ[3];
		
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ЗагрузитьСеть()
//	
//	ТекстАдресСети	 = ОбщиеКоманды_ат.ПреобразоватьЧислоВТекстовыйIP(Объект.АдресСети);
//	МассивАдресСети = ОбщиеКоманды_ат.РазложитьСтрокуВМассивПодстрок(ТекстАдресСети, ".");
//	Если МассивАдресСети = 4 тогда
//		
//		A3 = МассивАдресСети[0];
//		B3 = МассивАдресСети[1];
//		C3 = МассивАдресСети[2];
//		D3 = МассивАдресСети[3];
//		
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если ТекущийОбъект.НачальныйIP > ТекущийОбъект.КонечныйIP тогда
		временное = ТекущийОбъект.НачальныйIP;
		ТекущийОбъект.НачальныйIP =  ТекущийОбъект.КонечныйIP;
		ТекущийОбъект.КонечныйIP = временное;
	КонецЕсли;
	     ТекущийОбъект.ПредставлениеКонечныйIP		= РаботаССерверамиСлужебный_ат.ПреобразоватьЧислоВТекстовыйIP(ТекущийОбъект.КонечныйIP);
	     ТекущийОбъект.ПредставлениеНачальныйIP	= РаботаССерверамиСлужебный_ат.ПреобразоватьЧислоВТекстовыйIP(ТекущийОбъект.НачальныйIP);

		
КонецПроцедуры

&НаСервере
// данная процедура проверяет видимость и доступность компонентов в зависимости от выбранных опций-тригеров
Процедура ПроверкаОтображения()
	
	Элементы.ОписаниеПодсети.Видимость 				= ложь;
	Элементы.ОписаниеНачальногоИП.Доступность 	= Истина;
	Элементы.ОписаниеКонечногоИП.Доступность   	= Истина;

	Если Объект.Подсеть тогда
		
		Элементы.ОписаниеПодсети.Видимость 				= истина;
		Элементы.ОписаниеНачальногоИП.Доступность 	= ложь;
		Элементы.ОписаниеКонечногоИП.Доступность 		= ложь;
		
	КонецЕсли;

КонецПроцедуры // ПроверкаОтображения()

&НаКлиенте
Процедура ПодсетьПриИзменении(Элемент)
	Если	ЗначениеЗаполнено(A3) и  ЗначениеЗаполнено(B3) и  ЗначениеЗаполнено(C3) и  
			ЗначениеЗаполнено(D3) и НЕ Объект.МаскаСети = 0 тогда
		
		ТекстАдресСети=  "" + A3+"."+ B3+"."+C3+"."+D3;
		Объект.АдресСети = РаботаССерверамиСлужебный_ат.ПреобразоватьIPВЧисло(ТекстАдресСети);
		ВсегоАдресов = Pow(2, (32 - Число(Объект.МаскаСети)));
		intМаска = Pow(2,32) - ВсегоАдресов;
		Объект.АдресСети = РаботаССерверамиСлужебный_ат._AND(Объект.АдресСети, intМаска,32);
		
//		ТекстАдресСети = ОбщиеКоманды_ат.ПреобразоватьЧислоВТекстовыйIP(Объект.АдресСети,".");
		ЗаполняемАдресСети();   
		
		//заполняем начальный и конечный адрес
		Если ВсегоАдресов >= 4 тогда
			Объект.НачальныйIP	= Объект.АдресСети + 1;
			Объект.КонечныйIP	= Объект.АдресСети + ВсегоАдресов -2;
			
		ИначеЕсли ВсегоАдресов = 2 тогда
			
			Объект.НачальныйIP	= Объект.АдресСети ;
			Объект.КонечныйIP	= Объект.АдресСети +1;
			
		ИначеЕсли ВсегоАдресов = 1 тогда
			
			Объект.НачальныйIP	= Объект.АдресСети;
			Объект.КонечныйIP	= Объект.АдресСети;
		КонецЕсли;
		 ЗагрузитьИП();
		 
		//ТекстНачИП = ОбщиеКоманды_ат.ПреобразоватьЧислоВТекстовыйIP(Объект.НачальныйIP,	".");
		//ТекстКонИП = ОбщиеКоманды_ат.ПреобразоватьЧислоВТекстовыйIP(Объект.КонечныйIP,	".");
		//
		//МассивНачИП = ОбщиеКоманды_ат.РазложитьСтрокуВМассивПодстрок(ТекстНачИП,	".");
		//МассивКонИП = ОбщиеКоманды_ат.РазложитьСтрокуВМассивПодстрок(ТекстКонИП,	".");
		//
		//Если МассивНачИП.Количество() = 4 тогда
		//	
		//	A1 = МассивНачИП[0];
		//	B1 = МассивНачИП[1];
		//	C1 = МассивНачИП[2];
		//	D1 = МассивНачИП[3];
		//	
		//КонецЕсли;
		//Если МассивКонИП.Количество() = 4 тогда
		//	
		//	A2 = МассивКонИП[0];
		//	B2 = МассивКонИП[1];
		//	C2 = МассивКонИП[2];
		//	D2 = МассивКонИП[3];
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	ПроверкаОтображения();

КонецПроцедуры


Процедура ЗаполняемАдресСети()
	
	ТекстАдресСети = РаботаССерверамиСлужебный_ат.ПреобразоватьЧислоВТекстовыйIP(Объект.АдресСети,".");
	Массив = РаботаССерверамиСлужебный_ат.РазложитьСтрокуВМассивПодстрок(ТекстАдресСети, ".");
	
	Если Массив.Количество() = 4 тогда
		A3 = Число(Массив[0]);
		B3 = Число(Массив[1]);
		C3 = Число(Массив[2]);
		D3 = Число(Массив[3]);
	КонецЕсли;
	
КонецПроцедуры
